app/controllers/api/characters_controller.rb

    def index
      respond_with(Character.all)
---
SELECT "characters".* FROM "characters"

    def show
      respond_with(Character.find(params[:id]))
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]

    def create
      @character = Character.new(character_params)
      if @character.save
---
INSERT INTO "characters" ("name", "gender", "homeworld", "skin", "hair", "style", "personality") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test"], ["gender", "something"], ["homeworld", "NewDawn"], ["skin", "Brown"], ["hair", "Red"], ["style", "Practical"], ["personality", "Lovable Rogue"]]

    def update
      @character = Character.find(params[:id])
      if @character.update(character_params)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "characters" SET "name" = ? WHERE "characters"."id" = ?  [["name", "Zygon Problem Cat"], ["id", 3]]