app/controllers/api/games_controller.rb

    def index
      respond_with(Game.all)
---
SELECT "games".* FROM "games"