app/controllers/api/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
      respond_with(Item.all)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      respond_with(Item.find(params[:id]))