app/controllers/api/storycards_controller.rb

SELECT  "storycards".* FROM "storycards" WHERE "storycards"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      respond_with(Storycard.find(params[:id]))